# Getting started with pandas

In [1]:
from pandas import Series, DataFrame
import pandas as pd

In [2]:
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [3]:
%pwd

u'/git/stat504-python/PANDAS'

In [4]:
%cd ../book_scripts

[Errno 2] No such file or directory: '../book_scripts'
/git/stat504-python/PANDAS

## Introduction to pandas data structures

### Series

In [5]:
obj = Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [6]:
obj.values
obj.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [7]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index([u'd', u'b', u'a', u'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [11]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [12]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [13]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [14]:
'b' in obj2

True

In [15]:
'e' in obj2

False

In [16]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [17]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj4 = Series(sdata, index=states)
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [18]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [19]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [20]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [21]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [22]:
obj4

California      NaN
Ohio          35000
Oregon        16000
Texas         71000
dtype: float64

In [23]:
obj3 + obj4

California       NaN
Ohio           70000
Oregon         32000
Texas         142000
Utah             NaN
dtype: float64

In [24]:
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California      NaN
Ohio          35000
Oregon        16000
Texas         71000
Name: population, dtype: float64

In [25]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

### DataFrame

In [26]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [27]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [28]:
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [209]:
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])

ValueError: Shape of passed values is (1, 5), indices imply (4, 5)

In [205]:
frame2.columns

Index([u'a', u'b'], dtype='object')

In [31]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [32]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [33]:
frame2.ix['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [34]:
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [35]:
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5     0
two    2001    Ohio  1.7     1
three  2002    Ohio  3.6     2
four   2001  Nevada  2.4     3
five   2002  Nevada  2.9     4

In [216]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['eastern'] <> val
frame2

ValueError: Series lengths must match to compare

In [210]:
frame2['debt'] = frame2.state == 'Ohio'
frame2

AttributeError: 'DataFrame' object has no attribute 'state'

In [38]:
del frame2['eastern']
frame2.columns

Index([u'year', u'state', u'pop', u'debt'], dtype='object')

In [39]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [40]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [41]:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [42]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [43]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [44]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [45]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [46]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### Index objects

In [217]:
obj = Series(range(3), index=['a', 'b', 'c'])
index = obj.index
index

Index([u'a', u'b', u'c'], dtype='object')

In [218]:
index[1:]

Index([u'b', u'c'], dtype='object')

In [219]:
index[1] = 'd'

TypeError: Indexes does not support mutable operations

In [222]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [223]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [226]:
'Ohio' in frame3.columns

True

In [225]:
2003 in frame3.index

False

## Essential functionality

### Reindexing

In [227]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [228]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [ ]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) #default to row

In [229]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6), method='ffill') #ffill - forward fill - fills the NA from the previous value above

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [ ]:
frame = DataFrame(np.arange(9).reshape((3, 3)), index=['a', 'c', 'd'],
                  columns=['Ohio', 'Texas', 'California'])
frame

In [ ]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

In [ ]:
states = ['Texas', 'Utah', 'California'] #-redindex declaring the columns
frame.reindex(columns=states)

In [ ]:
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill',
              columns=states)

In [ ]:
frame.ix[['a', 'b', 'c', 'd'], states]

### Dropping entries from an axis

In [ ]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('c')
new_obj

In [ ]:
obj.drop(['d', 'c'])

In [ ]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])

In [ ]:
data.drop(['Colorado', 'Ohio'])

In [ ]:
data.drop('two', axis=1)

In [ ]:
data.drop(['two', 'four'], axis=1)

### Indexing, selection, and filtering

In [50]:
obj = Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj['b']

1.0

In [51]:
obj[1]

1.0

In [52]:
obj[2:4]

c    2
d    3
dtype: float64

In [53]:
obj[['b', 'a', 'd']]

b    1
a    0
d    3
dtype: float64

In [54]:
obj[[1, 3]]

b    1
d    3
dtype: float64

In [55]:
obj[obj < 2]

a    0
b    1
dtype: float64

In [56]:
obj['b':'c']

b    1
c    2
dtype: float64

In [57]:
obj['b':'c'] = 5
obj

a    0
b    5
c    5
d    3
dtype: float64

In [58]:
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [59]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [60]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [61]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [62]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [63]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [64]:
data[data < 5] = 0

In [65]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [66]:
data.ix['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [67]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [68]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [69]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [70]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### Arithmetic and data alignment

In [71]:
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [72]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [73]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [74]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [75]:
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [76]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [77]:
df1 + df2

           b   c   d   e
Colorado NaN NaN NaN NaN
Ohio       3 NaN   6 NaN
Oregon   NaN NaN NaN NaN
Texas      9 NaN  12 NaN
Utah     NaN NaN NaN NaN

#### Arithmetic methods with fill values

In [78]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [79]:
df2

    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

In [80]:
df1 + df2

    a   b   c   d   e
0   0   2   4   6 NaN
1   9  11  13  15 NaN
2  18  20  22  24 NaN
3 NaN NaN NaN NaN NaN

In [81]:
df1.add(df2, fill_value=0)

    a   b   c   d   e
0   0   2   4   6   4
1   9  11  13  15   9
2  18  20  22  24  14
3  15  16  17  18  19

In [82]:
df1.reindex(columns=df2.columns, fill_value=0)

   a  b   c   d  e
0  0  1   2   3  0
1  4  5   6   7  0
2  8  9  10  11  0

#### Operations between DataFrame and Series

In [83]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [84]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [85]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [86]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.ix[0]
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [87]:
series

b    0
d    1
e    2
Name: Utah, dtype: float64

In [88]:
frame - series

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [89]:
series2 = Series(range(3), index=['b', 'e', 'f'])
frame + series2

        b   d   e   f
Utah    0 NaN   3 NaN
Ohio    3 NaN   6 NaN
Texas   6 NaN   9 NaN
Oregon  9 NaN  12 NaN

In [90]:
series3 = frame['d']
frame

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [91]:
series3

Utah       1
Ohio       4
Texas      7
Oregon    10
Name: d, dtype: float64

In [92]:
frame.sub(series3, axis=0)

        b  d  e
Utah   -1  0  1
Ohio   -1  0  1
Texas  -1  0  1
Oregon -1  0  1

### Function application and mapping

In [93]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [94]:
frame

               b         d         e
Utah   -0.204708  0.478943 -0.519439
Ohio   -0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189 -1.296221

In [95]:
np.abs(frame)

               b         d         e
Utah    0.204708  0.478943  0.519439
Ohio    0.555730  1.965781  1.393406
Texas   0.092908  0.281746  0.769023
Oregon  1.246435  1.007189  1.296221

In [96]:
f = lambda x: x.max() - x.min()

In [97]:
frame.apply(f)

b    1.802165
d    1.684034
e    2.689627
dtype: float64

In [98]:
frame.apply(f, axis=1)

Utah      0.998382
Ohio      2.521511
Texas     0.676115
Oregon    2.542656
dtype: float64

In [99]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min -0.555730  0.281746 -1.296221
max  1.246435  1.965781  1.393406

In [100]:
format = lambda x: '%.2f' % x
frame.applymap(format)

            b     d      e
Utah    -0.20  0.48  -0.52
Ohio    -0.56  1.97   1.39
Texas    0.09  0.28   0.77
Oregon   1.25  1.01  -1.30

In [101]:
frame['e'].map(format)

Utah      -0.52
Ohio       1.39
Texas      0.77
Oregon    -1.30
Name: e, dtype: object

### Sorting and ranking

In [102]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [103]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [104]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [105]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [106]:
obj = Series([4, 7, -3, 2])
obj.order()

2   -3
3    2
0    4
1    7
dtype: int64

In [107]:
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

4    -3
5     2
0     4
2     7
1   NaN
3   NaN
dtype: float64

In [108]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [109]:
frame.sort_index(by='b')

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [110]:
frame.sort_index(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [111]:
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [112]:
obj.rank(method='first')

0    6
1    1
2    7
3    4
4    3
5    2
6    5
dtype: float64

In [113]:
obj.rank(ascending=False, method='max')

0    2
1    7
2    2
3    4
4    5
5    6
6    4
dtype: float64

In [114]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [115]:
frame.rank(axis=1)

   a  b  c
0  2  3  1
1  1  3  2
2  2  1  3
3  2  3  1

### Axis indexes with duplicate values

In [116]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [117]:
obj.index.is_unique

False

In [118]:
obj['a']

a    0
a    1
dtype: int64

In [119]:
obj['c']

4

In [120]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a  0.274992  0.228913  1.352917
a  0.886429 -2.001637 -0.371843
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

In [121]:
df.ix['b']

          0         1         2
b  1.669025 -0.438570 -0.539741
b  0.476985  3.248944 -1.021228

## Summarizing and computing descriptive statistics

In [122]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [123]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [124]:
df.sum(axis=1)

a    1.40
b    2.60
c     NaN
d   -0.55
dtype: float64

In [125]:
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [126]:
df.idxmax()

one    b
two    d
dtype: object

In [127]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [128]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [129]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

### Correlation and covariance

In [130]:
import pandas.io.data as web

all_data = {}
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = web.get_data_yahoo(ticker)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.iteritems()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.iteritems()})

In [131]:
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-09-11  0.014569  0.007114  0.008003  0.004389
2015-09-14  0.009631 -0.004043 -0.011671 -0.010120
2015-09-15  0.008412  0.019094  0.012908  0.021840
2015-09-16  0.001118  0.001322  0.005965  0.007276
2015-09-17 -0.021390  0.010881 -0.001819 -0.001129

In [132]:
returns.MSFT.corr(returns.IBM)

0.51284761135955181

In [133]:
returns.MSFT.cov(returns.IBM)

8.8399121274936957e-05

In [134]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.336883  0.399760  0.374339
GOOG  0.336883  1.000000  0.385646  0.444272
IBM   0.399760  0.385646  1.000000  0.512848
MSFT  0.374339  0.444272  0.512848  1.000000

In [135]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000086  0.000080  0.000092
GOOG  0.000086  0.000277  0.000077  0.000111
IBM   0.000080  0.000077  0.000141  0.000088
MSFT  0.000092  0.000111  0.000088  0.000211

In [136]:
returns.corrwith(returns.IBM)

AAPL    0.399760
GOOG    0.385646
IBM     1.000000
MSFT    0.512848
dtype: float64

In [137]:
returns.corrwith(volume)

AAPL   -0.092045
GOOG    0.194413
IBM    -0.185058
MSFT   -0.100175
dtype: float64

### Unique values, value counts, and membership

In [138]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [139]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [140]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [141]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [142]:
mask = obj.isin(['b', 'c'])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [143]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [144]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [145]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1    1    1    1
2    0    2    1
3    2    2    0
4    2    0    2
5    0    0    1

## Handling missing data

In [146]:
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [147]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [148]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### Filtering out missing data

In [149]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [150]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [151]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [152]:
cleaned

   0    1  2
0  1  6.5  3

In [153]:
data.dropna(how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
3 NaN  6.5   3

In [154]:
data[4] = NA
data

    0    1   2   4
0   1  6.5   3 NaN
1   1  NaN NaN NaN
2 NaN  NaN NaN NaN
3 NaN  6.5   3 NaN

In [155]:
data.dropna(axis=1, how='all')

    0    1   2
0   1  6.5   3
1   1  NaN NaN
2 NaN  NaN NaN
3 NaN  6.5   3

In [156]:
df = DataFrame(np.random.randn(7, 3))
df.ix[:4, 1] = NA; df.ix[:2, 2] = NA
df

          0         1         2
0 -0.577087       NaN       NaN
1  0.523772       NaN       NaN
2 -0.713544       NaN       NaN
3 -1.860761       NaN  0.560145
4 -1.265934       NaN -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [157]:
df.dropna(thresh=3)

          0         1         2
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

### Filling in missing data

In [158]:
df.fillna(0)

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [159]:
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -0.577087  0.500000       NaN
1  0.523772  0.500000       NaN
2 -0.713544  0.500000       NaN
3 -1.860761  0.500000  0.560145
4 -1.265934  0.500000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [160]:
# always returns a reference to the filled object
_ = df.fillna(0, inplace=True)
df

          0         1         2
0 -0.577087  0.000000  0.000000
1  0.523772  0.000000  0.000000
2 -0.713544  0.000000  0.000000
3 -1.860761  0.000000  0.560145
4 -1.265934  0.000000 -1.063512
5  0.332883 -2.359419 -0.199543
6 -1.541996 -0.970736 -1.307030

In [161]:
df = DataFrame(np.random.randn(6, 3))
df.ix[2:, 1] = NA; df.ix[4:, 2] = NA
df

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674       NaN  1.004812
3  1.327195       NaN -1.549106
4  0.022185       NaN       NaN
5  0.862580       NaN       NaN

In [162]:
df.fillna(method='ffill')

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185  1.349742 -1.549106
5  0.862580  1.349742 -1.549106

In [163]:
df.fillna(method='ffill', limit=2)

          0         1         2
0  0.286350  0.377984 -0.753887
1  0.331286  1.349742  0.069877
2  0.246674  1.349742  1.004812
3  1.327195  1.349742 -1.549106
4  0.022185       NaN -1.549106
5  0.862580       NaN -1.549106

In [164]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## Hierarchical indexing

In [165]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [166]:
data.index

MultiIndex(levels=[[u'a', u'b', u'c', u'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [167]:
data['b']

1   -0.023493
2   -2.304234
3   -0.652469
dtype: float64

In [168]:
data['b':'c']

b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
dtype: float64

In [169]:
data.ix[['b', 'd']]

b  1   -0.023493
   2   -2.304234
   3   -0.652469
d  2    1.074623
   3    0.723642
dtype: float64

In [170]:
data[:, 2]

a    0.852965
b   -2.304234
c   -1.332610
d    1.074623
dtype: float64

In [171]:
data.unstack()

          1         2         3
a  0.670216  0.852965 -0.955869
b -0.023493 -2.304234 -0.652469
c -1.218302 -1.332610       NaN
d       NaN  1.074623  0.723642

In [172]:
data.unstack().stack()

a  1    0.670216
   2    0.852965
   3   -0.955869
b  1   -0.023493
   2   -2.304234
   3   -0.652469
c  1   -1.218302
   2   -1.332610
d  2    1.074623
   3    0.723642
dtype: float64

In [173]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [174]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [175]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

### Reordering and sorting levels

In [176]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [177]:
frame.sortlevel(1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [178]:
frame.swaplevel(0, 1).sortlevel(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### Summary statistics by level

In [179]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [180]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### Using a DataFrame's columns

In [181]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [182]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [183]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [184]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## Other pandas topics

### Integer indexing

In [185]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [186]:
ser

0    0
1    1
2    2
dtype: float64

In [187]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [188]:
ser.ix[:1]

0    0
1    1
dtype: float64

In [189]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [190]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]

0    0
1    1
Name: 2, dtype: int64

### Panel data

In [191]:
import pandas.io.data as web

pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

In [192]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 1457 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2010-01-04 00:00:00 to 2015-09-17 00:00:00
Minor_axis axis: Open to Adj Close

In [193]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

                  AAPL      DELL        GOOG       MSFT
Date
2010-01-04   28.588685  14.06528         NaN  26.593966
2010-01-05   28.638111  14.38450         NaN  26.602557
2010-01-06   28.182584  14.10397         NaN  26.439299
2010-01-07   28.130486  14.23940         NaN  26.164338
2010-01-08   28.317506  14.36516         NaN  26.344781
2010-01-11   28.067701  14.37483         NaN  26.009671
2010-01-12   27.748431  14.56830         NaN  25.837820
2010-01-13   28.139837  14.57797         NaN  26.078412
2010-01-14   27.976862  14.22005         NaN  26.602557
2010-01-15   27.509312  13.92985         NaN  26.516632
2010-01-19   28.726277  14.32646         NaN  26.722854
2010-01-20   28.284109  14.03626         NaN  26.284633
2010-01-21   27.795185  13.92017         NaN  25.786265
2010-01-22   26.416581  13.18982         NaN  24.884045
2010-01-25   27.127257  13.43650         NaN  25.193378
2010-01-26   27.510648  13.13662         NaN  25.348044
2010-01-27   27.769805  13.08825         NaN  25.494118
2010-01-28   26.622302  12.84641         NaN  25.055897
2010-01-29   25.656478  12.47882         NaN  24.213827
2010-02-01   26.013151  12.78837         NaN  24.411455
2010-02-02   26.164103  12.86576         NaN  24.454417
2010-02-03   26.614287  12.92380         NaN  24.600491
2010-02-04   25.655142  12.58523         NaN  23.921680
2010-02-05   26.110669  12.80772         NaN  24.076346
2010-02-08   25.931664  12.95282         NaN  23.818568
2010-02-09   26.208187  13.10760         NaN  24.067753
2010-02-10   26.065251  13.30107         NaN  24.050568
2010-02-11   26.539479  13.49454         NaN  24.162272
2010-02-12   26.767910  13.38813         NaN  23.999013
2010-02-16   27.171339  13.67834         NaN  24.473814
...                ...       ...         ...        ...
2015-08-06  115.129997       NaN  642.679993  46.314584
2015-08-07  115.519997       NaN  635.299988  46.433801
2015-08-10  119.720001       NaN  633.729980  47.019936
2015-08-11  113.489998       NaN  660.780029  46.105961
2015-08-12  115.239998       NaN  659.559998  46.433801
2015-08-13  115.150002       NaN  656.450012  46.423864
2015-08-14  115.959999       NaN  657.119995  46.692096
2015-08-17  117.160004       NaN  660.869995  47.009999
2015-08-18  116.500000       NaN  656.130005  47.270000
2015-08-19  115.010002       NaN  660.900024  46.610001
2015-08-20  112.650002       NaN  646.830017  45.660000
2015-08-21  105.760002       NaN  612.479980  43.070000
2015-08-24  103.120003       NaN  589.609985  41.680000
2015-08-25  103.739998       NaN  582.059998  40.470001
2015-08-26  109.690002       NaN  628.619995  42.709999
2015-08-27  112.919998       NaN  637.609985  43.900002
2015-08-28  113.290001       NaN  630.380005  43.930000
2015-08-31  112.760002       NaN  618.250000  43.520000
2015-09-01  107.720001       NaN  597.789978  41.820000
2015-09-02  112.339996       NaN  614.340027  43.360001
2015-09-03  110.370003       NaN  606.250000  43.500000
2015-09-04  109.269997       NaN  600.700012  42.610001
2015-09-08  112.309998       NaN  614.659973  43.889999
2015-09-09  110.150002       NaN  612.719971  43.070000
2015-09-10  112.570000       NaN  621.349976  43.290001
2015-09-11  114.209999       NaN  625.770020  43.480000
2015-09-14  115.309998       NaN  623.239990  43.040001
2015-09-15  116.279999       NaN  635.140015  43.980000
2015-09-16  116.410004       NaN  635.979980  44.299999
2015-09-17  113.919998       NaN  642.900024  44.250000

[1457 rows x 4 columns]

In [194]:
pdata.ix[:, '6/1/2012', :]

            Open        High         Low       Close     Volume  Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900  74.940263
DELL   12.150000   12.300000   12.045000   12.070000   19397600  11.675920
GOOG         NaN         NaN         NaN         NaN        NaN        NaN
MSFT   28.760000   28.959999   28.440001   28.450001   56634300  25.955799

In [195]:
pdata.ix['Adj Close', '5/22/2012':, :]

                  AAPL      DELL        GOOG       MSFT
Date
2012-05-22   74.403254  14.58765         NaN  27.150951
2012-05-23   76.218678  12.08221         NaN  26.557936
2012-05-24   75.518694  12.04351         NaN  26.521442
2012-05-25   75.113925  12.05319         NaN  26.512319
2012-05-28         NaN  12.05319         NaN        NaN
2012-05-29   76.447109  12.24666         NaN  26.968484
2012-05-30   77.368854  12.14992         NaN  26.767772
2012-05-31   77.176494  11.92743         NaN  26.630923
2012-06-01   74.940263  11.67592         NaN  25.955799
2012-06-04   75.381096  11.60821         NaN  26.047030
2012-06-05   75.186067  11.76298         NaN  26.010538
2012-06-06   76.338911  11.81619         NaN  26.776896
2012-06-07   76.373641  11.73396         NaN  26.667415
2012-06-08   77.522476  11.72429         NaN  27.050594
2012-06-11   76.300165  11.47278         NaN  26.366346
2012-06-12   76.966761  11.57919         NaN  26.722156
2012-06-13   76.432420  11.87423         NaN  26.576182
2012-06-14   76.348257  11.93711         NaN  26.767772
2012-06-15   76.695581  11.89841         NaN  27.388157
2012-06-18   78.251853  12.01449         NaN  27.223937
2012-06-19   78.469605  11.78233         NaN  28.008542
2012-06-20   78.246509  11.89841         NaN  28.218377
2012-06-21   77.168475  11.60821         NaN  27.497636
2012-06-22   77.760261  11.80168         NaN  28.008542
2012-06-25   76.246737  11.55500         NaN  27.251308
2012-06-26   76.415055  11.53565         NaN  27.388157
2012-06-27   76.745007  11.92743         NaN  27.525006
2012-06-28   76.016964  11.55984         NaN  27.287800
2012-06-29   78.014076  12.10155         NaN  27.908185
2012-07-02   79.152224  11.98064         NaN  27.880814
...                ...       ...         ...        ...
2015-08-06  115.129997       NaN  642.679993  46.314584
2015-08-07  115.519997       NaN  635.299988  46.433801
2015-08-10  119.720001       NaN  633.729980  47.019936
2015-08-11  113.489998       NaN  660.780029  46.105961
2015-08-12  115.239998       NaN  659.559998  46.433801
2015-08-13  115.150002       NaN  656.450012  46.423864
2015-08-14  115.959999       NaN  657.119995  46.692096
2015-08-17  117.160004       NaN  660.869995  47.009999
2015-08-18  116.500000       NaN  656.130005  47.270000
2015-08-19  115.010002       NaN  660.900024  46.610001
2015-08-20  112.650002       NaN  646.830017  45.660000
2015-08-21  105.760002       NaN  612.479980  43.070000
2015-08-24  103.120003       NaN  589.609985  41.680000
2015-08-25  103.739998       NaN  582.059998  40.470001
2015-08-26  109.690002       NaN  628.619995  42.709999
2015-08-27  112.919998       NaN  637.609985  43.900002
2015-08-28  113.290001       NaN  630.380005  43.930000
2015-08-31  112.760002       NaN  618.250000  43.520000
2015-09-01  107.720001       NaN  597.789978  41.820000
2015-09-02  112.339996       NaN  614.340027  43.360001
2015-09-03  110.370003       NaN  606.250000  43.500000
2015-09-04  109.269997       NaN  600.700012  42.610001
2015-09-08  112.309998       NaN  614.659973  43.889999
2015-09-09  110.150002       NaN  612.719971  43.070000
2015-09-10  112.570000       NaN  621.349976  43.290001
2015-09-11  114.209999       NaN  625.770020  43.480000
2015-09-14  115.309998       NaN  623.239990  43.040001
2015-09-15  116.279999       NaN  635.140015  43.980000
2015-09-16  116.410004       NaN  635.979980  44.299999
2015-09-17  113.919998       NaN  642.900024  44.250000

[850 rows x 4 columns]

In [196]:
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

                        Open        High         Low       Close     Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400
           DELL    12.590000   12.700000   12.460000   12.560000   19787800
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600
           DELL    12.530000   12.540000   12.330000   12.330000   19955600
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900
           DELL    12.150000   12.300000   12.045000   12.070000   19397600
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300
2012-06-04 AAPL   561.500008  567.499985  548.499977  564.289978  139248900
           DELL    12.110000   12.112500   11.800000   12.000000   17015700
           MSFT    28.620001   28.780001   28.320000   28.549999   47926300
2012-06-05 AAPL   561.269989  566.470001  558.330002  562.830025   97053600
           DELL    11.950000   12.240000   11.950000   12.160000   15620900
           MSFT    28.510000   28.750000   28.389999   28.510000   45715400
2012-06-06 AAPL   567.770004  573.849983  565.499992  571.460022  100363900
           DELL    12.210000   12.280000   12.090000   12.215000   20779900
           MSFT    28.879999   29.370001   28.809999   29.350000   46860500
2012-06-07 AAPL   577.290009  577.320023  570.500000  571.720001   94941700
           DELL    12.320000   12.410000   12.120000   12.130000   20074000
           MSFT    29.639999   29.700001   29.170000   29.230000   37792800
2012-06-08 AAPL   571.599998  580.580017  568.999992  580.319984   86879100
           DELL    12.130000   12.225000   12.020000   12.120000   18155600
           MSFT    29.209999   29.680000   29.049999   29.650000   42551100
2012-06-11 AAPL   587.719994  588.499985  570.629990  571.169975  147816200
           DELL    12.150000   12.200000   11.820000   11.860000   16931900
           MSFT    29.730000   29.809999   28.820000   28.900000   46361900
2012-06-12 AAPL   574.459984  576.619980  566.700020  576.159996  108845100
           DELL    11.910000   12.010000   11.680000   11.970000   17608100
           MSFT    29.100000   29.299999   28.840000   29.290001   35337900
...                      ...         ...         ...         ...        ...
2015-09-03 AAPL   112.489998  112.779999  110.040001  110.370003   52906400
           GOOG   617.000000  619.710022  602.820984  606.250000    1750800
           MSFT    43.410000   43.980000   43.279999   43.500000   28053200
2015-09-04 AAPL   108.970001  110.449997  108.510002  109.269997   49963900
           GOOG   600.000000  603.469971  595.250000  600.700012    2089000
           MSFT    42.810001   43.040001   42.200001   42.610001   37124100
2015-09-08 AAPL   111.750000  112.559998  110.320000  112.309998   54114200
           GOOG   612.489990  616.309998  604.119995  614.659973    2270800
           MSFT    43.299999   44.000000   43.200001   43.889999   32204900
2015-09-09 AAPL   113.760002  114.019997  109.769997  110.150002   84344400
           GOOG   621.219971  626.520020  609.599976  612.719971    1693900
           MSFT    44.209999   44.400002   42.910000   43.070000   33318800
2015-09-10 AAPL   110.269997  113.279999  109.900002  112.570000   62675200
           GOOG   613.099976  624.159973  611.429993  621.349976    1900500
           MSFT    43.119999   43.790001   42.750000   43.290001   31234200
2015-09-11 AAPL   111.790001  114.209999  111.760002  114.209999   49441800
           GOOG   619.750000  625.780029  617.419983  625.770020    1360900
           MSFT    43.139999   43.590000   42.939999   43.480000   26184400
2015-09-14 AAPL   116.580002  116.889999  114.860001  115.309998   58201900
           GOOG   625.700012  625.859985  619.429993  623.239990    1698400
           MSFT    43.430000   43.439999   42.860001   43.040001   23633300
2015-09-15 AAPL   115.930000  116.529999  114.419998  116.279999   43004100
           GOOG   626.700012  638.700012  623.780029  635.140015    2082100
           MSFT    43.189999   44.290001   43.080002   43.980000   28662100
2015-09-16 AAPL   116.250000  116.540001  115.440002  116.410004   36910000
           GOOG   635.469971  637.950012  632.320007  635.979980    1276100
           MSFT    43.970001   44.380001   43.840000   44.299999   23256700
2015-09-17 AAPL   115.660004  116.489998  113.720001  113.919998   63462700
           GOOG   637.789978  650.900024  635.020020  642.900024    2259100
           MSFT    44.290001   45.000000   44.080002   44.250000   29817900

                   Adj Close
Date       minor
2012-05-30 AAPL    77.368854
           DELL    12.149920
           MSFT    26.767772
2012-05-31 AAPL    77.176494
           DELL    11.927430
           MSFT    26.630923
2012-06-01 AAPL    74.940263
           DELL    11.675920
           MSFT    25.955799
2012-06-04 AAPL    75.381096
           DELL    11.608210
           MSFT    26.047030
2012-06-05 AAPL    75.186067
           DELL    11.762980
           MSFT    26.010538
2012-06-06 AAPL    76.338911
           DELL    11.816190
           MSFT    26.776896
2012-06-07 AAPL    76.373641
           DELL    11.733960
           MSFT    26.667415
2012-06-08 AAPL    77.522476
           DELL    11.724290
           MSFT    27.050594
2012-06-11 AAPL    76.300165
           DELL    11.472780
           MSFT    26.366346
2012-06-12 AAPL    76.966761
           DELL    11.579190
           MSFT    26.722156
...                      ...
2015-09-03 AAPL   110.370003
           GOOG   606.250000
           MSFT    43.500000
2015-09-04 AAPL   109.269997
           GOOG   600.700012
           MSFT    42.610001
2015-09-08 AAPL   112.309998
           GOOG   614.659973
           MSFT    43.889999
2015-09-09 AAPL   110.150002
           GOOG   612.719971
           MSFT    43.070000
2015-09-10 AAPL   112.570000
           GOOG   621.349976
           MSFT    43.290001
2015-09-11 AAPL   114.209999
           GOOG   625.770020
           MSFT    43.480000
2015-09-14 AAPL   115.309998
           GOOG   623.239990
           MSFT    43.040001
2015-09-15 AAPL   116.279999
           GOOG   635.140015
           MSFT    43.980000
2015-09-16 AAPL   116.410004
           GOOG   635.979980
           MSFT    44.299999
2015-09-17 AAPL   113.919998
           GOOG   642.900024
           MSFT    44.250000

[2405 rows x 6 columns]

In [197]:
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 844 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2015-09-17 00:00:00
Minor_axis axis: AAPL to MSFT